app/Models/EnderecosModel.php

SELECT *
FROM `enderecos`
WHERE `cliente_id` = 1
---
    public function buscarPorCliente(int $clienteId): array
    {
        return $this->where('cliente_id', $clienteId)->findAll();