app/Models/LocacoesModel.php

    public function buscarLocacaoPorItemId(int $itemId): ?array
    {
        return $this->select('locacoes.*, enderecos.*, clientes.nome as cliente_nome')
            ->join('enderecos', 'enderecos.id = locacoes.endereco_id')
            ->join('clientes', 'clientes.id = locacoes.cliente_id')
            ->where('locacoes.locacao_item_id', $itemId)
            ->where('locacoes.status', 'ativo')
            ->first();
---
SELECT `locacoes`.*, `enderecos`.*
FROM `locacoes`
JOIN `enderecos` ON `enderecos`.`id` = `locacoes`.`endereco_id`
WHERE `locacoes`.`locacao_item_id` = 1
AND `locacoes`.`status` = 'ativo'
 LIMIT 1