app/Models/LocacoesModel.php

    public function buscarLocacaoPorItemId(int $itemId): ?array
    {
        return $this->select('
            locacoes.id AS locacao_id,
            locacoes.cliente_id,
            locacoes.locacao_item_id,
            locacoes.endereco_id,
            locacoes.data_inicio,
            locacoes.data_fim,
            locacoes.data_retirada,
            locacoes.preco_total,
            locacoes.forma_pagamento,
            locacoes.observacoes,
            locacoes.status,
            locacoes.created_at,
            locacoes.updated_at,

            enderecos.cep,
            enderecos.logradouro,
            enderecos.numero,
            enderecos.complemento,
            enderecos.bairro,
            enderecos.cidade,
            enderecos.estado,

            clientes.nome AS cliente_nome,
            clientes.telefone AS cliente_telefone,
            itens_locacoes.item AS item_nome,
            itens_locacoes.categoria AS item_categoria,
        ')
            ->join('enderecos', 'enderecos.id = locacoes.endereco_id')
            ->join('clientes', 'clientes.id = locacoes.cliente_id')
            ->join('itens_locacoes', 'itens_locacoes.id = locacoes.locacao_item_id')
            ->where('locacoes.locacao_item_id', $itemId)
            ->where('locacoes.status', 'ativo')
            ->first();
---
SELECT `locacoes`.`id` AS `locacao_id`, `locacoes`.`cliente_id`, `locacoes`.`locacao_item_id`, `locacoes`.`endereco_id`, `locacoes`.`data_inicio`, `locacoes`.`data_fim`, `locacoes`.`data_retirada`, `locacoes`.`preco_total`, `locacoes`.`forma_pagamento`, `locacoes`.`observacoes`, `locacoes`.`status`, `locacoes`.`created_at`, `locacoes`.`updated_at`, `enderecos`.`cep`, `enderecos`.`logradouro`, `enderecos`.`numero`, `enderecos`.`complemento`, `enderecos`.`bairro`, `enderecos`.`cidade`, `enderecos`.`estado`, `clientes`.`nome` AS `cliente_nome`, `clientes`.`telefone` AS `cliente_telefone`, `itens_locacoes`.`item` AS `item_nome`, `itens_locacoes`.`categoria` AS `item_categoria`
FROM `locacoes`
JOIN `enderecos` ON `enderecos`.`id` = `locacoes`.`endereco_id`
JOIN `clientes` ON `clientes`.`id` = `locacoes`.`cliente_id`
JOIN `itens_locacoes` ON `itens_locacoes`.`id` = `locacoes`.`locacao_item_id`
WHERE `locacoes`.`locacao_item_id` = 29
AND `locacoes`.`status` = 'ativo'
 LIMIT 1